Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret.terraform_test must be replaced
-/+ resource "aws_secretsmanager_secret" "terraform_test" {
      ~ arn                            = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test-889xI8" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test-889xI8" -> (known after apply)
      ~ name                           = "terraform_test" -> "terraform_test_v3" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      ~ rotation_enabled               = false -> (known after apply)
      + rotation_lambda_arn            = (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.terraform_test1 will be destroyed
  # (because aws_secretsmanager_secret.terraform_test1 is not in configuration)
- resource "aws_secretsmanager_secret" "terraform_test1" {
      - arn                            = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test1-oz18I6" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test1-oz18I6" -> null
      - name                           = "terraform_test1" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.terraform_test_docker will be destroyed
  # (because aws_secretsmanager_secret.terraform_test_docker is not in configuration)
- resource "aws_secretsmanager_secret" "terraform_test_docker" {
      - arn                            = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test_docker-FOvjZ8" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ap-south-1:301838289846:secret:terraform_test_docker-FOvjZ8" -> null
      - name                           = "terraform_test_docker" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-13-235-121-243.ap-south-1.compute.amazonaws.com:4141/lock?id=AthivaTechnology%252Fatalntis-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`